Repository: juanp88/pokedex
Catalog: lib/l10n/app_*.arb
Languages: es

# searchHint
source: What Pokémon are you looking for?
es: ¿Qué Pokémon estás buscando?

# loadingMorePokemon
source: Loading more Pokémon...
es: Cargando más Pokémon...

source: Using cached data
es: Usando datos en caché

source: No Internet Connection
es: Sin Conexión a Internet

# noInternetMessage
source: No cached Pokemon data available.\nConnect to the internet to load Pokemon.
es: No hay datos de Pokémon en caché disponibles.\nConéctate a internet para cargar Pokémon.

source: Retry
es: Reintentar

source: Cache Management
es: Gestión de Caché

source: Cache Statistics
es: Estadísticas de Caché

source: Pokemon Details Cached
es: Detalles de Pokémon en Caché

source: Pokemon Cards Cached
es: Tarjetas de Pokémon en Caché

source: Main List Cached
es: Lista Principal en Caché

source: Cache Size
es: Tamaño de Caché

source: Cache Actions
es: Acciones de Caché

source: Clear Expired Cache
es: Limpiar Caché Expirado

# clearExpiredCacheDesc
source: Remove only expired cache entries
es: Eliminar solo entradas de caché expiradas

source: Pre-cache Images
es: Pre-cachear Imágenes

# preCacheImagesDesc
source: Download images for offline viewing
es: Descargar imágenes para visualización offline

source: Clear All Cache
es: Limpiar Todo el Caché

# clearAllCacheDesc
source: Remove all cached data
es: Eliminar todos los datos en caché

source: About Caching
es: Acerca del Caché

source: Cache Benefits:
es: Beneficios del Caché:

# fasterLoading
source: • Faster app loading times
es: • Tiempos de carga más rápidos

source: • Reduced data usage
es: • Uso reducido de datos

# worksOffline
source: • Works offline for cached Pokemon
es: • Funciona offline para Pokémon en caché

# imagesCached
source: • Images cached for offline viewing
es: • Imágenes en caché para visualización offline

# improvedExperience
source: • Improved user experience
es: • Experiencia de usuario mejorada

source: Cache Details:
es: Detalles del Caché:

# cacheExpires
source: • Cache expires after 24 hours
es: • El caché expira después de 24 horas

# autoClears
source: • Automatically clears expired data
es: • Limpia automáticamente datos expirados

# storesData
source: • Stores Pokemon details and images
es: • Almacena detalles e imágenes de Pokémon

# autoImageCache
source: • Images auto-cached when viewed online
es: • Imágenes auto-cacheadas al verlas online

# manualImageCache
source: • Manual image pre-caching available
es: • Pre-caché manual de imágenes disponible

# safeToClear
source: • Safe to clear anytime
es: • Seguro de limpiar en cualquier momento

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

# clearAllCacheTitle
source: Clear All Cache
es: Limpiar Todo el Caché

# clearAllCacheMessage
source: This will remove all cached Pokemon data. The app will need to reload data from the internet.
es: Esto eliminará todos los datos de Pokémon en caché. La app necesitará recargar datos desde internet.

# preCacheImagesTitle
source: Pre-cache Images
es: Pre-cachear Imágenes

# preCacheImagesMessage
source: This will download Pokemon images for offline viewing. This may take a few minutes and use data.
es: Esto descargará imágenes de Pokémon para visualización offline. Puede tomar unos minutos y usar datos.

# cacheCleared
source: Cache cleared successfully
es: Caché limpiado exitosamente

# expiredCacheCleared
source: Expired cache cleared successfully
es: Caché expirado limpiado exitosamente

# startingImageCache
source: Starting image pre-caching...
es: Iniciando pre-caché de imágenes...

# imagesCacheComplete
source: Images pre-cached successfully
es: Imágenes pre-cacheadas exitosamente

# errorClearingCache
source: Error clearing cache: {error}
es: Error limpiando caché: {error}

# errorLoadingStats
source: Error loading cache stats: {error}
es: Error cargando estadísticas de caché: {error}

# errorPreCachingImages
source: Error pre-caching images: {error}
es: Error pre-cacheando imágenes: {error}

# pokemonNotFound
source: Pokémon "{name}" not found!
es: ¡Pokémon "{name}" no encontrado!

source: Refresh Stats
es: Actualizar Estadísticas

source: Yes
es: Sí

source: Loading...
es: Cargando...

source: Unknown
es: Desconocido

source: Species
es: Especie

source: Height
es: Altura

source: Weight
es: Peso

source: Abilities
es: Habilidades

source: Stats
es: Estadísticas

source: About
es: Acerca de

source: Moves
es: Movimientos

source: Offline mode
es: Modo offline

source: Pokedex Data
es: Datos de Pokedex

source: HP
es: PS

source: ATK
es: ATQ

source: SATK
es: ATESP

source: SDEF
es: DEFESP

source: SPD
es: VEL
